Итоговый_проект_3_мобильная_версия/src/Documents/Доставка/Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доставка</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоставок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Итоговый_проект_3_мобильная_версия/src/Documents/Доставка/Forms/ФормаДокумента/Module.bsl
//Добавьте в документ «Доставка» реквизит «Фото», реализуйте возможность создать фото 
//с помощью камеры мобильного устройства и вывести его на форму   

&НаКлиенте
Процедура АдресФотоНажатие(Элемент, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеКлиент Тогда
		
		//отключаем стандартную обработку, ткт стандартное действие 
		//для обработки нажатия на строку - вывести её содержимое в предупреждение, нам это не нужно
		СтандартнаяОбработка = Ложь;
		
		Если Не СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
			Возврат;
		КонецЕсли;
		
		Данные = СредстваМультимедиа.СделатьФотоснимок();
		
		Если Данные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		АдресФото = ПоместитьВоВременноеХранилище(Данные.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//сохраним картинку в хранилище значения и сохраним в реквизит фотографию
	Если ЗначениеЗаполнено(АдресФото) Тогда
		//получим двоичные данные фото
		ДвоичныеДанныеФото = ПолучитьИзВременногоХранилища(АдресФото);
		ДанныеВХранилище = Новый ХранилищеЗначения (ДвоичныеДанныеФото);
		ТекущийОбъект.Фото = ДанныеВХранилище;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// при открытии наобходимо получить фото поместить ее во временное хранилище и заполнить реквизит формы
	ДвоичныеДанныеФото = ТекущийОбъект.Фото.Получить();
	АдресФото = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФото, УникальныйИдентификатор); 
	
	//получение номера телефона контрагента из Справочника
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.НомерТелефона КАК НомерТелефона
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Ссылка"; 
	Запрос.УстановитьПараметр("Ссылка", Объект.Контрагент);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Объект.НомерТелефона = Выборка[0].НомерТелефона;
КонецПроцедуры

&НаКлиенте
Процедура Позвонить(Команда)
	#Если МобильноеПриложениеКлиент Тогда
		
		Если ЗначениеЗаполнено(Объект.НомерТелефона)Тогда
			СредстваТелефонии.НабратьНомер(Объект.НомерТелефона, Ложь);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не указан номер телефона";
			Сообщение.Поле = "НомерТелефона";
			Сообщение.Сообщить();
		КонецЕсли;
		
	#КонецЕсли
КонецПроцедуры
